Revit 2024 API
BuiltInFailures.PerformanceFailures.UnjoinedRoomSeparationLinesFound Property
 Room Separation of <element> is not joined, might cause performance issue with room boundaries computations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnjoinedRoomSeparationLinesFound { get; }
Visual Basic
Public Shared ReadOnly Property UnjoinedRoomSeparationLinesFound As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnjoinedRoomSeparationLinesFound {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace